import React from "react"


export const Cocomo = () => (
    <div className="mb-4">
        <i>COCOMO (Constructive Cost Model)</i> – это конструктивная модель стоимости, разработанная в начале 80-х годов Барри
        Боэмом для оценки трудоемкости разработки программных продуктов. Она основана на статистическом анализе
        фактических данных по выполнению 63 проектов в компании TRW Aerospace, где Барри Боэм был директором отдела
        исследований программного обеспечения и технологий. Анализировались проекты объемом от 2 до 100 тысяч строк
        кода, на языках программирования от ассемблеров до высокоуровневого языка PL/1, основанные на каскадной модели
        жизненного цикла разработки ПО.
    </div>
)